In [1]:
import pandas as pd

In [24]:
# training data for loan prediction
df = pd.read_csv('loan_prediction/loan_train.csv')
df.head()
df.size

7982

In [4]:
# testing data for loan prediction
df1 = pd.read_csv('loan_prediction/loan_test.csv')
dfn.size

4404

In [26]:
# to print all the column names of the dataset
#df.columns

In [18]:
# top 5 values of Loan_ID and Gender by passing the list of all the columns to be parsed by us
df['Loan_ID'].head()
df[['Loan_ID','Gender']].head()

    Loan_ID Gender
0  LP001002   Male
1  LP001003   Male
2  LP001005   Male
3  LP001006   Male
4  LP001008   Male

In [29]:
# to select rows by their values
# the below query will return 1st 5 rows similar to head command
df.iloc[:5]

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [35]:
# to select 2 columns of 1st 5 rows out of the dataframe using 2 methods
df.iloc[:5,:2]
df.iloc[:,:2].head()

    Loan_ID Gender
0  LP001002   Male
1  LP001003   Male
2  LP001005   Male
3  LP001006   Male
4  LP001008   Male

In [42]:
# to return values of rows having gender as male
print(df[df['Gender']=='Male'].shape[0])
# and the total no of rows in data
df.shape[0]

489

614